## 0. DataCamp

Those who want to continue using DataCamp can find the pandas course [here](https://campus.datacamp.com/courses/intermediate-python/dictionaries-pandas?ex=9).

## 1. Getting and knowing your data

*Source: https://pandas.pydata.org/docs/getting_started/tutorials.html, Ex 01_03*

Import data from a csv-table and go through the following steps to familliarize yourself with the pandas dataframe:

In [1]:
import pandas as pd

1.1 Given the csv-file below, import its data, seperate by `|` and make use the first column as index

In [2]:
csv_file = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'

users = pd.read_csv(csv_file, sep='|', index_col='user_id')

1.2 View the first 5 rows

In [3]:
users.head(5)

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

1.3 View the last 2 entries

In [4]:
users.tail(2)

         age gender occupation zip_code
user_id
942       48      F  librarian    78209
943       22      M    student    77841

1.4. Display the number of rows and columns of the dataset (using methods of the dataframe)

In [5]:
users.shape

(943, 4)

1.5 Display the labels of all columns

In [6]:
users.columns.to_list()

['age', 'gender', 'occupation', 'zip_code']

1.6 Display the index list

In [7]:
users.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

1.7 Display the data type of each column

In [8]:
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

1.8 Display only the `occupation`-column

In [9]:
users.occupation

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

1.9 Use `describe()` to display some statistical information about the data set. Set the according keywords such that all columns are returned (by default only numeric columns are returned)

In [10]:
users.describe(include='all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

1.10 Display some statistical inforamtion about only the `age`-column

In [11]:
users.age.describe()

count    943.000000
mean      34.051962
std       12.192740
min        7.000000
25%       25.000000
50%       31.000000
75%       43.000000
max       73.000000
Name: age, dtype: float64

1.11 What is the mean age of users?

In [12]:
users.age.mean()

34.05196182396607

1.12 Find a way to display the age with least occurence

In [13]:
users.age.value_counts().tail()

11    1
10    1
73    1
66    1
7     1
Name: age, dtype: int64

## 2. Merging data frames

Have a look at the output from a data frame `df` of the very last cell.

1. Create `df` manually (manually means create the data first, then call `pd.DataFrame()`).
2. Create `df` by merging a data frame with a copy of itself.

In [14]:
import numpy as np
import pandas as pd


data = np.arange(12).reshape(4, 3)

df1 = pd.DataFrame(np.concatenate((data, data)), columns=['A', 'B', 'C'])
df1

   A   B   C
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11
4  0   1   2
5  3   4   5
6  6   7   8
7  9  10  11

In [15]:
import numpy as np
import pandas as pd


data = np.arange(12).reshape(4, 3)

df1 = pd.DataFrame(data, columns=['A', 'B', 'C'])
df2 = df1.copy()
df = df1.append(df2, ignore_index=True)
df

   A   B   C
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11
4  0   1   2
5  3   4   5
6  6   7   8
7  9  10  11